WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Get the current status to determine why ISR called
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  //----------------------------------------------------------
  // Check UIF (Update Interrupt Flag), which indicates CNT changed.
  // This is used to maintain the overflow count. The overflow count
  // is not a problem for 32-bit timers but for 16-bit it is.
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;

    // We need to account for the timer's CNT overflow and use it in the
    // individual input calculations.
    // Note: with a 96 MHz clock a 16-bit timer will rollover every 683
    // microseconds and at 960 kHz it will rollover every 68.3 milliseconds,
    // about 14.6 times/second.
    //
    // What is done here is to have a 32-bit value for the timer count and
    // another for the overflow value. This approach will effectively add
    // 32-bits to each timers size.
    mdwFreqTimerInfo->timerOverflow++;
  }

  //----------------------------------------------------------
  // Channel 1
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    // (--) Diag
    stm32_gpiowrite(DEBUG_PIN_V2_D06, true);
    
    timStatusReg &= ~GTIM_SR_CC1IF;

    // Ignore if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_1)
    {
      // Channel data pointer
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_1];
      if(mdwFreqChanData == NULL)
      {
        syslog(1, "%s@%d-Channel 1-mdwFreqChanData is NULL in ISR\n", __FILE__, __LINE__);
        return -ERROR;  // -1
      }

      // From this point the code is identical for all channels
      // Read the captured value. This resets reg value to 0.
      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);

      // Read the input GPIO state to determine raising or falling edge.
      bool inputState = stm32_gpioread(mdwFreqChanData->inputConfig);
      if(inputState)
      {
        // Raising edge is end of previous capture and the beginning of a
        // new capture
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // End is now
        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
      else
      {
        // Falling edge
        mdwFreqChanData->midCaptureCnt = capturedCount;
        mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
      }
    }

    // (--) Diag
    stm32_gpiowrite(DEBUG_PIN_V2_D06, false);
  }

  //----------------------------------------------------------
  // Channel 2
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;

    // Ignore if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_2)
    {
      // Channel data pointer
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_2];
      if(mdwFreqChanData == NULL)
      {
        syslog(1, "%s@%d-Channel 2-mdwFreqChanData is NULL in ISR\n", __FILE__, __LINE__);
        return -ERROR;  // -1
      }

      // Read the captured/control reg value. This resets reg value to 0.
      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);

      // Read the input GPIO state to determine raising or falling edge.
      bool inputState = stm32_gpioread(mdwFreqChanData->inputConfig);
      if(inputState)
      {
        // Raising edge is end of previous capture and the beginning of a
        // new capture
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // End is now
        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
      else
      {
        // Falling edge
        mdwFreqChanData->midCaptureCnt = capturedCount;
        mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
      }
    }
  }

  //----------------------------------------------------------
  // Channel 3
  if(timStatusReg & GTIM_SR_CC3IF)
  {
    timStatusReg &= ~GTIM_SR_CC3IF;
    // Ignore if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_3)
    {
      // Channel data pointer
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_3];
      if(mdwFreqChanData == NULL)
      {
        syslog(1, "%s@%d-Channel 3-mdwFreqChanData is NULL in ISR\n", __FILE__, __LINE__);
        return -ERROR;  // -1
      }

      // Read the captured/control reg value. This resets reg value to 0.
      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR3_OFFSET);

      // Read the input GPIO state to determine raising or falling edge.
      bool inputState = stm32_gpioread(mdwFreqChanData->inputConfig);
      if(inputState)
      {
        // Raising edge is end of previous capture and the beginning of a
        // new capture
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // End is now
        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
      else
      {
        // Falling edge
        mdwFreqChanData->midCaptureCnt = capturedCount;
        mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
      }
    }
  }

  //----------------------------------------------------------
  // Channel 4
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;

    // Ignore if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_4)
    {
      // Channel data pointer
      mdwFreqChanData_t *mdwFreqChanData = 
                mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_4];
      if(mdwFreqChanData == NULL)
      {
        syslog(1, "%s@%d-Channel 4-mdwFreqChanData is NULL in ISR\n", __FILE__, __LINE__);
        return -ERROR;  // -1
      }

      // Read the captured/control reg value. This resets reg value to 0.
      uint32_t capturedCount = getreg32(timerBase + STM32_GTIM_CCR4_OFFSET);

      // Read the input GPIO state to determine raising or falling edge.
      bool inputState = stm32_gpioread(mdwFreqChanData->inputConfig);
      if(inputState)
      {
        // Raising edge is end of previous capture and the beginning of a
        // new capture
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // End is now
        mdwFreqChanData->endResultCnt = capturedCount;
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
      else
      {
        // Falling edge
        mdwFreqChanData->midCaptureCnt = capturedCount;
        mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
      }
    }
  }

  // Clear the timer's status register
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  return OK;
}

