WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_4)
  {
    // Capture/compare mode reg 2, chan 4
    regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
    regVal32 &= ~(GTIM_CCMR2_CC4S_MASK);
    regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
    putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

    ccerRegVal |= (GTIM_CCER_CC4P | GTIM_CCER_CC4NP);     // 11 both edges
    // ccerRegVal &= ~(GTIM_CCER_CC4P | GTIM_CCER_CC4NP); // 00 rising only
    ccerRegVal |= GTIM_CCER_CC4E;   // Enable capture channel 4
    dierRegVal |= GTIM_DIER_CC4IE;  // DMA/Interrupt enable
  }

  // Clear all interrupt sources and then set the needed ones in the
  // DMA/Interrupt Enable Register.
  // Note: Advanced timers 1 & 8 add ATIM_DIER_COMIE, ATIM_DIER_BIE and
  // ATIM_DIER_COMDE
  modifyreg16(timerBase + STM32_GTIM_DIER_OFFSET, 
          (GTIM_DIER_TDE   | GTIM_DIER_CC4DE | GTIM_DIER_CC3DE | GTIM_DIER_CC2DE |
           GTIM_DIER_CC1DE | GTIM_DIER_UDE   | GTIM_DIER_TIE   | GTIM_DIER_CC4IE |
           GTIM_DIER_CC3IE | GTIM_DIER_CC2IE | GTIM_DIER_CC1IE | GTIM_DIER_UIE),
          dierRegVal);
  // putreg16(dierRegVal, timerBase + STM32_GTIM_DIER_OFFSET);

  // Capture/Compare Enable Register 
  putreg16(ccerRegVal, timerBase + STM32_GTIM_CCER_OFFSET);

  return OK;
}

//=============================================================
// Configuration of timer registers.
int meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  int ret;
  uint32_t regVal32;

  if(mdwFreqTimerInfo == NULL)
    return -ENXIO;

  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  
  // Slave mode control register
  regVal32 = getreg32(timerBase + STM32_GTIM_SMCR_OFFSET);
  regVal32 &= ~(GTIM_SMCR_ECE | GTIM_SMCR_DISAB | GTIM_SMCR_SMS);
  putreg32(regVal32, timerBase + STM32_GTIM_SMCR_OFFSET);

  // To enable the timer we needed to know which clock enable register to use.
  // And we need to know which bit to set in the register
  uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);
  modifyreg32(apbClock, 0, mdwFreqTimerInfo->timerClkEn);

  // (--) NEW FEATURE IMPLEMENTED HERE? ALLOW USER TO SELECT FREQUENCY VIA
  // SLOW, MEDIUM AND FAST SELECTION? BUT NOT PER CHANNEL, PER TIMER
  // ?? Find proper pre-scaler value so all timers run at the same speed, no
  // ?? matter which clock line they are connected to.
  //
  // Must be between 0 and 0xffff. Set the prescaler value of 0 to allow
  // highest speed, allowed by MEADOW_FREQ_CLOCK_FREQ.
  // A prescaler value of 1 will divide the clock by 2.
  uint16_t prescaler = (meadow_measure_freq_get_max_clock(mdwFreqTimerInfo)/ \
            MEADOW_FREQ_CLOCK_FREQ) - 1;
  putreg16(prescaler, timerBase + STM32_GTIM_PSC_OFFSET);

  // The value put into the ARR is maximum allowed for the timer. Either
  // 32-bit or 16-bit ARR register.
  uint32_t maxARRValue = mdwFreqTimerInfo->timerWidth ==
            MEADOW_FREQ_TIMER_WIDTH_16 ? 0xffff : 0xffffffff;
  putreg32(maxARRValue, timerBase + STM32_GTIM_ARR_OFFSET);

  // Control Register 1
  uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  regval |= GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

  // All interrupts are handled by the same ISR code, but each timer has a
  // different interrupt vector.
  ret = irq_attach(mdwFreqTimerInfo->timerIrqVec,
            meadow_measure_freq_isr,  // ISR address
            mdwFreqTimerInfo);        // Argument to ISR
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Enable timer
  meadow_measure_freq_enable(timerBase);

  // Lastly enable IRQ
  up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

  return OK;
}

//=============================================================
// Called to unconfigure a timer
int meadow_measure_freq_unconfigure(const uint32_t timerNumber)
{
  // mdwFreqTimerInfo_t *mdwFreqTimerInfo =
  //           meadow_measure_freq_chk_get_timer_info(timerNumber);

  // // Is this slot being used?
  // if(mdwFreqTimerInfo->mdwFreqChanData == NULL)
  // {
  //   syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
  //             __FILE__, __LINE__, timerNumber);
  //   return -EBADSLT;    // Invalid slot
  // }

  // // Stop interrupts
  // up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // // Stop timer
  // meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // // Unconfigure GPIO
  // stm32_unconfiggpio(mdwFreqTimerInfo->mdwFreqChanData->inputConfig);

  // // Free runtime memory
  // free(mdwFreqTimerInfo->mdwFreqChanData);
  // mdwFreqTimerInfo->mdwFreqChanData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
// Moved as much processing here as apposed to the ISR.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t
          *returnData)
{
  // 64 bytes of stack space
  double dblFrequency;
  double dblDutyCycle;
  double dblTotalInputCount;
  double dblAvgFreq;
  uint64_t halfCycle;
  uint64_t fullCycle;
  uint64_t regOvrFloTimSize;
  uint64_t bgnCapture;
  uint64_t midCapture;
  uint64_t endCapture;
  uint64_t totalCaptureTime;
  uint64_t endCaptureTime = meadow_measure_freq_get_current_time();

  syslog(1, "-->Returning data-for timer:%lu, channel:%lu\n",
            returnData->timerNumber, returnData->channelNumber);

  // Verify that provided timer and channel are valid
  if(returnData->timerNumber > 14 || returnData->timerNumber < 1)
  {
    syslog(2, "%s@%d-Timer must be 1 - 14\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }
  
  if(returnData->channelNumber > 4 || returnData->channelNumber < 1)
  {
    syslog(2, "%s@%d-Channel must be 1 - 4\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }

  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return -1;
  }

  // Is the channel configured?
  uint8_t channelBit = meadow_measure_freq_get_chan_bit_set(
          returnData->channelNumber);
  if((mdwFreqTimerInfo->chanActiveBits & channelBit) == 0)
  {
    syslog(1, "%s@%d-Unconfigured channel accessed\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  mdwFreqChanData_t *mdwFreqChanData =
            mdwFreqTimerInfo->mdwFreqChanData[returnData->channelNumber - 1];
  if(mdwFreqChanData == NULL)
  {
    syslog(1, "%s@%d-Channel data NULL\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  // We need the timer's width to do the overflow math
  if(mdwFreqTimerInfo->timerWidth)
    regOvrFloTimSize = MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
  else
    regOvrFloTimSize = MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;

  uint64_t ovrFloStartCnt = mdwFreqChanData->bgnResultOvr;

  // Add in the overflow counts
  bgnCapture = mdwFreqChanData->bgnResultCnt + \
        ((mdwFreqChanData->bgnResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  midCapture = mdwFreqChanData->midResultCnt + \
        ((mdwFreqChanData->midResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  endCapture = mdwFreqChanData->endResultCnt + \
        ((mdwFreqChanData->endResultOvr - ovrFloStartCnt) * regOvrFloTimSize);
  
  // Normalize around the beginning
  fullCycle = endCapture - bgnCapture;
  halfCycle = midCapture - bgnCapture;

  // To help preserve resolution, use floating point math.
  syslog(1, "==>%s@%d-Snapshot-bgnCapture:%llu, full Count:%llu, half Count:%llu, inputTotal:%llu\n",
            __FILE__, __LINE__, bgnCapture,
            fullCycle, halfCycle,
            mdwFreqChanData->gpioCountForAvg);

  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  totalCaptureTime = endCaptureTime - mdwFreqChanData->startTimeForAvg;

  // Convert time in nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->gpioCountForAvg;
  dblAvgFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  syslog(1, "==>In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.4f, Count:%lu\n",
            dblFrequency, dblDutyCycle, dblAvgFreq,
            (uint32_t)dblTotalInputCount);

  returnData->frequencyX1000  = (dblFrequency * 1000.0);
  returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  returnData->avgFreqX1000    = (dblAvgFreq   * 1000.0);
  returnData->gpioCountForAvg = (uint32_t)dblTotalInputCount;

  // Reset capture counts and Meadow time for next average
  mdwFreqChanData->gpioCountForAvg = 0;
  mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
